---
type: RepeaterCoordinates
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# RepeaterCoordinates

`Autodesk.Revit.DB.RepeaterCoordinates` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RepeaterCoordinates | — | `` |
| Constructor | RepeaterCoordinates | 2014 | `public RepeaterCoordinates ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCoordinate | 2014 | `public int GetCoordinate ( int dimension )` |
| Property | DimensionCount | 2014 | `public int DimensionCount { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |